
#ΠΡΟΣΟΧΗ!
#Σβήνει όλες τις μεταβλητές περιβάλλοντος που τυχόν υπάρχουν ήδη. Πηγή: https://community.rstudio.com/t/how-to-clear-the-r-environment/14303
rm(list = ls())

# 
# Β.1) Να διατυπώσετε τον κατάλληλο έλεγχο υποθέσεων για τον ισχυρισμό ότι το
# μέσο μηνιαίο πλήθος απεσταλμένων «SMS_BEFORE» στον αντίστοιχο πληθυσμό
# διαφέρει στατιστικά σημαντικά από τις 100 μονάδες. Σχολιάστε.


#Φόρτωμα αρχείου
library(readxl)

cat("","\n\t")

cat("   Ερώτημα  B.1","\n")


R_LAB_DATA_NEW_V3<-read_excel("R_LAB_DATA_NEW_V3.xlsx");

print(t.test(R_LAB_DATA_NEW_V3$SMS_BEFORE, mu = 100 , alternative = "two.sided",conf.level = 0.95))



cat("Επειδή το p-value = 2.2e-16 είναι πολύ μικρότερο από το επίπεδο σημαντικότητας","\n")
cat("α = 0.05, απορρίπτω την ΗΟ (ότι ο μέσος όρος του πληθυσμού είναι 100) ,","\n")
cat("για χάρη της εναλλακτικής Η1 (ότι ο μέσος όρος του πληθυσμού δεν είναι 100). ","\n")
cat("Θα ήταν χρήσιμο να εξετάσω επιπλέον, αν ο πληθυσμιακός μέσος είναι μεγαλύτερος ή ","\n")
cat("μικρότερος από το 100. Το διάστημα εμπιστοσύνης που μας εκτυπώνει το t-test ","\n")
cat("υποδεικνύει πως είναι μεγαλύτερος ","\n")



# 
# Β.2) Να διατυπώσετε τον κατάλληλο έλεγχο υποθέσεων για τoν ισχυρισμό ότι το
# μέσο
# μηνιαίο πλήθος
# απεσταλμένων «SMS_BEFORE» από γυναίκες στον
# αντίστοιχο πληθυσμό διαφέρει στατιστικά σημαντικά από το αντίστοιχο μέσο
# μηνιαίο πλήθος απεσταλμένων «SMS_BEFORE» από άνδρες. Σχολιάστε.


cat("   Ερώτημα  B.2","\n")


SMS_BEFORE_WOMEN<-R_LAB_DATA_NEW_V3$SMS_BEFORE[R_LAB_DATA_NEW_V3$MF == 2]

SMS_BEFORE_MEN<-R_LAB_DATA_NEW_V3$SMS_BEFORE[R_LAB_DATA_NEW_V3$MF == 1]


print(t.test(SMS_BEFORE_MEN,SMS_BEFORE_WOMEN,alternative = "two.sided" ,conf.level = 0.95, mu=0))


cat("Επειδή το p-value = 0.2002 είναι μεγαλύτερο από το επίπεδο σημαντικότητας α = 0.05","\n")
cat("Δεν απορρίπτω την ΗΟ, ότι δηλαδή η διαφορά των μέσων των δυο πληθυσμών είναι μηδενική.","\n")
cat("Παρατηρούμε επίσης πως το μηδέν συμπεριλαμβάνεται στο διάστημα εμπιστοσύνης.","\n\n")



# Β.3) Να διατυπώσετε τον κατάλληλο έλεγχο υποθέσεων για τoν ισχυρισμό ότι το
# μηνιαίο ποσοστό
# απεσταλμένων μηνυμάτων μέσω VIBER
# από γυναίκες στον
# αντίστοιχο πληθυσμό διαφέρει στατιστικά σημαντικά από το αντίστοιχο μηνιαίο
# ποσοστό απεσταλμένων μηνυμάτων μέσω VIBER από άνδρες. Σχολιάστε.


cat("   Ερώτημα  B.3","\n")




VIBER_WOMEN<-R_LAB_DATA_NEW_V3$VIBER[R_LAB_DATA_NEW_V3$MF == 2]

VIBER_MEN<-R_LAB_DATA_NEW_V3$VIBER[R_LAB_DATA_NEW_V3$MF == 1]


print(t.test(VIBER_WOMEN,VIBER_MEN,conf.level = 0.95,alternative = "two.sided"))

cat("Επειδή το p-value = 0.2433 δεν απορρίπτω την HO σε επίπεδο σημαντικότητας α = 0.05","\n")
cat("για χάρη της εναλλακτικής.","\n")
cat("Παρατηρούμε ότι το μηδέν συμπεριλαμβάνεται στο διάστημα εμπιστοσύνης.","\n")
cat("Επιπλέον αν κοιτάξουμε τα ποσοστά χρήσης για γυναίκες και άντρες είναι","\n")
cat("0.4347826 και 0.5308642 αντίστοιχα. Διαισθητικά θα λέγαμε πως διαφέρουν","\n")
cat("ωστόσο η διαίσθηση μας, μας απατά αν θέλουμε να δεχθούμε σφάλμα τύπου Ι 5%","\n\n")



# 
# 
# Β.4) Να διατυπώσετε τον κατάλληλο έλεγχο υποθέσεων για τoν ισχυρισμό ότι η
# διαφημιστική εκστρατεία των εταιρειών κινητής τηλεφωνίας αυξάνει το μέσο
# μηνιαίο πλήθος απεσταλμένων SMS . Σχολιάστε.


cat("   Ερώτημα  B.4","\n")

# 
# Β.4) Να διατυπώσετε τον κατάλληλο έλεγχο υποθέσεων για τoν ισχυρισμό ότι η
# διαφημιστική εκστρατεία των εταιρειών κινητής τηλεφωνίας αυξάνει το μέσο
# μηνιαίο πλήθος απεσταλμένων SMS . Σχολιάστε.



print(t.test(R_LAB_DATA_NEW_V3$SMS_AFTER,R_LAB_DATA_NEW_V3$SMS_BEFORE, mu=0 , alternative = "greater", paired = TRUE))


cat("Επειδή το p-value =2.2e-16 απορρίπτω την HO σε επίπεδο σημαντικότητας α = 0.05","\n")
cat("και αποδέχομαι την Η1 ότι ο μέσος όρος των μηνυμάτων μετά την εκστρατεία είναι ","\n")
cat("μεγαλύτερος από αυτόν πριν την εκστρατεία ","\n")




