
#ΠΡΟΣΟΧΗ!
#Σβήνει όλες τις μεταβλητές περιβάλλοντος που τυχόν υπάρχουν ήδη. Πηγή: https://community.rstudio.com/t/how-to-clear-the-r-environment/14303
rm(list = ls())

# 
# Β.1) Να διατυπώσετε τον κατάλληλο έλεγχο υποθέσεων για τον ισχυρισμό ότι το
# μέσο μηνιαίο πλήθος απεσταλμένων «SMS_BEFORE» στον αντίστοιχο πληθυσμό
# διαφέρει στατιστικά σημαντικά από τις 100 μονάδες. Σχολιάστε.


#Φόρτωμα αρχείου
library(readxl)



R_LAB_DATA_NEW_V3<-read_excel("R_LAB_DATA_NEW_V3.xlsx");

# 
# 
# Να μελετηθεί η αποτελεσματικότητα της διαφημιστικής εκστρατείας που
# περιγράφεται στο (Β.4) ερώτημα εφαρμόζοντας κατάλληλα το μοντέλο της απλής
# γραμμικής παλινδρόμησης (κατασκευή διαγράμματος διασποράς, εύρεση δειγματικής
# ευθείας ελαχίστων τετραγώνων,  διεξαγωγή ελέγχου υποθέσεως γραμμικής
# συσχέτισης, Χ=SMS_BEFORE, Y=SMS_AFTER)



#Αποθηκευση διαγράμματος
jpeg(file="SMS_BEFORE_AFTER_SCATTER_PLOT.jpeg");

scatter.smooth(R_LAB_DATA_NEW_V3$SMS_BEFORE,R_LAB_DATA_NEW_V3$SMS_AFTER,xlab = "SMS BEFORE campaign",
               ylab = "SMS AFTER campaign",main="SMS AFTER - SMS BEFORE" )

dev.off()



print(lm(R_LAB_DATA_NEW_V3$SMS_AFTER ~ R_LAB_DATA_NEW_V3$SMS_BEFORE))


cat("","\n")

cat("Με τη μέθοδο των ελαχίστων τετραγώνων προκύπτει ότι:","\n")
cat("o σταθερός όρος α_hat = 50.1264 ","\n")
cat("o συντελεστής της ανεξάρτητης μεταβλητής Χ, β_hat = 0.6057  ","\n\n")


cat("Ελέγχουμε αν οι εκτιμήσεις για τις παραμέτρους του γραμμικού μοντέλου είναι στατιστικά σημαντικές.","\n\n")



print(summary(lm(R_LAB_DATA_NEW_V3$SMS_AFTER ~ R_LAB_DATA_NEW_V3$SMS_BEFORE)))

cat("Οι παράμετροι α και β έχουν και οι δυο p-value = 2e-16","\n")
cat("Συνεπώς είναι ισχυρά στατιστικά σημαντικές. (Σε επίπεδο σημαντικότητας α = 0.01)","\n")
cat("Επίπλέον, η διαφημιστική εκστρατεία κρίνεται πετυχημένη λόγω του θετικών παραμέτρων α_hat , β_hat του δείγματος","\n\n")



cat("Ο λόγος της διακύμανσης που ερμηνεύεται από το μοντέλο προς τη συνολική διακύμανση","\n")
cat("μας δίνει ένα μέτρο για το πόσο καλά προσαρμόζεται το μοντέλο στα δεδομένα εδώ R^2 = 0.6097.","\n")
cat("Για το στατιστικό F η μηδενική υπόθεση H0 είναι ότι το μοντέλο δεν έχει καμία ","\n")
cat("δυνατότητα πρόβλεψης και Η1 ότι έχει.","\n")
cat("Επειδή το p-value για το στατιστικό F, είναι 2.2e-16 απόδεχόμαστε με ισχυρή πεποίθηση την ΗΟ.","\n")
cat("Αν το γραμμικό μοντέλο αποτύχει μπορούμε να περάσουμε στην παραβολή ελαχίστων τετραγώνων.","\n\n\t\t\t")



cat("Συσχέτιση και εξάρτηση","\n\n")

cat("Θα πρέπει να είμαστε ιδιαίτερα προσεκτικοί, όταν ερμηνεύουμε τα αποτελέσματα συσχέτισης,","\n")
cat("καθώς η ύπαρξη συσχέτισης δεν συνεπάγεται αιτιότητα ή εξάρτηση.","\n\n")


cat("Παράδειγμα 1:","\n")
cat("Έστω η τυχαία μεταβλητή Χ που αντιπροσωπεύει το ύψος ενός ανθρώπου","\n")
cat("και η τυχαία μεταβλητή Υ αντιπροσωπεύει το βάρος του. Ο συντελεστής συσχέτισης για τον","\n")
cat("πληθυσμό ρ^2 > 0 ,τότε μπορούμε να ισχυριστούμε ότι υπάρχει αλληλοεξάρτηση μεταξύ του","\n")
cat("ύψους και του βάρους.","\n\n")


cat("Παράδειγμα 2:  Έστω η τυχαία μεταβλητή Χ που αναπαριστά το πλήθος των φοιτητών και καθηγητών στον ","\n")
cat("Ταύρο ανά μήνα.","")
cat("Υ η τυχαία μεταβλητή για τη μηνιαία εγκληματικότητα στον Ταύρο την ίδια χρονική ","\n")
cat("περίοδο. Μπορεί να προκυψει από το γραμμικό μοντέλο ότι β>0 , δηλαδή να υπάρχει θετική συσχέτιση.","\n")
cat("O ακαδημαϊκός πληθυσμός εχει μειωθεί εξ'αιτίας της τηλεκπαίδευσης.","\n")
cat("Η εγκληματικότητα έχει μειωθεί λόγω μειωμένης ανθρώπινης δραστηριότητας.","\n")
cat("Είναι εντελώς παρακινδυνευμένο να ισχυριστούμε πως η λειτουργία του ","\n")
cat("Χαροκοπείου αυξάνει την εγκληματικότητα.","\n\n\n")


cat("Στο παρακάτω link βρίσκονται μερικές πετυχημένες στατιστικά συσχετίσεις.","\n")
cat("Ωστόσο οποιαδήποτε απόδοση αιτιότητας ή εξάρτησης στις τυχαίες μεταβλητές είναι αποτυχημένη.","\n\n")
cat("https://www.tylervigen.com/spurious-correlations")























